Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །སྟོང་རྩ་བརྒྱད་བཟླས་པས་མི་འཕམ་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་པདྨ་ཆེན་པོའི་དབང་བསྐུར་བ་ཡིད་བཞིན་གྱི་ནོར་བུའི་པདྨ་བཅིངས་པས་སྤྱི་བོར་མངོན་པར་དབང་བསྐུར་བར་འགྱུར་རོ།
en: After one thousand and eight recitations he will receive the great lotus consecration into the maṇḍalas of all the invincible tathāgatas and will be consecrated with the wish-fulfilling jewel lotus that then attaches itself to his head.

source: །དེ་ནས་དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱིས་བཟླས་པ་ཙམ་གྱི་མོད་ལ་དེའི་རྨི་ལམ་མཐོང་བ་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: After reciting the dhāraṇī, he will receive a sign from the tathāgatas of the three times in his sleep.

source: །དཀྱིལ་འཁོར་ཆེན་པོ་ཡངས་པའི་རྣམ་པར་འཕྲུལ་པ་ཡང་དག་པར་མཐོང་བ་དང་ཆོ་འཕྲུལ་སྟོན་པར་བྱེད་དོ།
en: They will display a great wondrous spectacle before him, a vast and great maṇḍala full of marvels and miraculous displays.

source: །གཞལ་ཡས་ཁང་དང་བཅས། རྣམ་པར་འཕྲུལ་པ་དང་བཅས། ལྷའི་ཚོགས་དང་བཅས་པའི་རིག་པའི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་པའི་ལྷ་རྣམས་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: They will display great palaces inhabited by hosts of devas and full of wonders. “

source: །འདི་ལྟ་སྟེ།
en: The tathāgatas will also cause the deities of the maṇḍala of the king of vidyās to appear.

source: དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་དང་། པདྨའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་དང་། རྡོ་རྗེའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་དང་། ནོར་བུའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་དང་། དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དང་།
en: They will display the maṇḍala of the tathāgata family, the maṇḍala of the lotus family, the maṇḍala of the vajra family, the maṇḍala of the jewel family, the great maṇḍala of liberation that constitutes the heart essence of Amoghapāśa, and the great maṇḍala inhabited by Vairocana.

source: རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོའི་དཀྱིལ་འཁོར་ཆེན་པོ་དེ་རྣམས་ཐམས་ཅད་ཀྱང་སོ་སོ་སོ་སོའི་དཀྱིལ་འཁོར་དུ་དབང་བསྐུར་བས་མངོན་པར་དབང་བསྐུར་རོ། །རིག་པའི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་གྱི་ལྷ་རྣམས་མཐའ་དག་ཉེ་བར་སྟོན་པར་བྱེད་དེ།
en: Subsequently, each tathāgata will individually consecrate the vidyā holder into each of the maṇḍalas and will cause the deities of the maṇḍala of the king of vidyās to appear.

source: ཇི་སྲིད་དུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གཤེགས་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། བདུད་འདུལ་བའི་བར་གྱི་དཀྱིལ་འཁོར་ཉེ་བར་སྟོན་པར་བྱེད་དོ།
en: The tathāgatas will display the maṇḍala until the vidyā holder attains the seat of awakening, sets in motion the wheel of Dharma, and subdues Māra.

source: །དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱིས་ཀྱང་དཀྱིལ་འཁོར་ཆེན་པོ་དེ་རྣམས་ཀྱིས་སོ་སོ་སོ་སོའི་དཀྱིལ་འཁོར་དུ་མངོན་པར་དབང་བསྐུར་བས་མངོན་པར་དབང་སྐུར་བར་མཛད་དོ།
en: These tathāgatas, established throughout the three times—the three great maṇḍalas—will each bestow the individual maṇḍala consecrations upon the vidyā holder.

source: །དཀྱིལ་འཁོར་གྱི་མཆོག་ཐམས་ཅད་དུ་མངོན་པར་དབང་བསྐུར་བས་མངོན་པར་དབང་སྐུར་བར་མཛད་དོ།
en: They will give him consecrations into all supreme maṇḍalas. “

source: །དེ་ནས་རིག་སྔགས་འཆང་དེ་དེ་ལྟ་བུའི་རྨི་ལམ་ཆེན་པོ་མཐོང་ནས། དགའ་བ་ཆེན་པོ་རྒྱས་པར་འགྱུར་རོ།
en: The vidyā holder, seeing this great display in his dream, will be overwhelmed with an intense feeling of affection.

source: །དགའ་བ་དང་རབ་ཏུ་མགུ་བའི་སྙིང་དེས་ཀྱང་དོན་ཡོད་པ་པདྨའི་དྲི་མ་མེད་པའི་མངོན་པར་དབང་བསྐུར་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་བོ།
en: Because of the affection and joy swelling in his heart, he will obtain the consecration of the stainless amogha lotus and the corresponding samādhi.

source: །དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱིས་ཀྱང་།
en: The tathāgatas will applaud him, saying, ‘Good!

source: རིག་སྔགས་འཆང་དེ་ལ་ལེགས་སོ་ལེགས་སོ་ཞེས་རྗོད་པར་མཛད་དེ།
en: It is good!

source: རིག་སྔགས་འཆང་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ཆེན་པོའི་རིགས་ཐུན་མོང་བའི་དམ་ཚིག་གིས་མངོན་པར་དབང་བསྐུར་བས་ཁྱོད་མངོན་པར་དབང་བསྐུར་རོ།
en: You have received, O great vidyā holder, the samaya consecration of the great maṇḍala where all tathāgata families are the same.

source: །གྲུབ་པ་ཐོབ་པ་དེ་རྣམས་རིག་སྔགས་འཆང་ཆེན་པོ་དང་དཀྱིལ་འཁོར་གྱི་གསང་བའི་རྗེས་སུ་འཇུག་ཅིང་།
en: You have become accomplished and have entered, O vidyā holder, the secret maṇḍala.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྲས་ཀྱི་ཐུ་བོར་འགྱུར་རོ་ཞེས་སོ་སོར་སད་དོ།
en: May you become the eldest son of all the tathāgatas!

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས།
en: May you become fully realized!’ “

source: བཟླས་པ་ཙམ་དང་བཀླགས་པ་ཙམ་གྱིས་དེ་མ་ཐག་པར་རྒྱ་ཆེན་པོའི་ཡོན་ཏན་གསལ་བ་དེ་ལྟ་བུ་སྐྱེ་བར་འགྱུར་རོ། །སླར་ཡང་འདིའི་གོང་ནས་གོང་དུ་རྣམ་པར་འཕྲུལ་པ་སྟོན་པར་བྱེད་དོ། །རིག་སྔགས་འཆང་གང་ཡང་། རིགས་ཀྱི་བུའམ།
en: By merely reciting or reading the dhāraṇī, the vidyā holder will manifest the splendor of possessing many good qualities, and I will display ever more miracles to him.

source: རིགས་ཀྱི་བུ་མོ་གཞན་གང་ཡང་རུང་བར་གྱུར་ཀྱང་རུང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མར་གྱུར་ཀྱང་རུང་སྟེ་དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་དང་། དབང་བསྐུར་བ་བྱེད་པར་འདོད་པ་དེས་གཟུངས་ཀྱི་སྙིང་པོ་འདིས་བགྲང་ཕྲེང་ངམ། ཅོད་པན་ནམ། དར་དཔྱངས་སམ། དབུ་རྒྱན་ལ་ལན་སྟོང་རྩ་བརྒྱད་དུ་ཡོངས་སུ་བཟླས་ཏེ་དེ་བཞིན་གཤེགས་པའི་དབུ་ལ་བཅིངས་ན། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་མངོན་པར་དབང་བསྐུར་ཏེ།
en: If any vidyā holder—be they the son or daughter of good family, a monk or nun, or a male or female lay practitioner—wants to perform the rite of the consecration of offerings for all the tathāgatas of the three times, they should incant a necklace, diadem, bandana, or crown with the heart dhāraṇī, either one hundred and eight or one thousand and eight times, and attach it to their head in order to receive the consecration of Avalokiteśvara. “

source: རིག་སྔགས་འཆང་དེའམ། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ།
en: By this act, the vidyā holder—be they a son or a daughter of good family, a monk or a nun, or a male or female lay practitioner—will be consecrated into each and every secret, great maṇḍala.

source: དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མས་གསང་བའི་དཀྱིལ་འཁོར་ཆེན་པོ་རེ་རེའི་དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་འཁོར་དང་བཅས་པ་རྣམས་ཀྱིས་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱུང་བའི་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོའི་ནོར་བུ་ཆེན་པོ་ཡིད་བཞིན་གྱི་ནོར་བུའི་རིན་པོ་ཆེའི་དབུ་རྒྱན་འོད་ཟེར་སྣ་ཚོགས་བརྒྱ་སྟོང་ཕྲག་འབར་བས་ཡང་དག་པར་བརྒྱན་པའི་དབུ་རྒྱན་ཆེན་པོ་དང་། དར་དཔྱངས་ཀྱིས་དབང་བསྐུར་བས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་པར་དབང་བསྐུར་བར་འགྱུར་ཞིང་།
en: They will be consecrated by the tathāgatas of the three times and by the bodhisattvas with their retinues whose bodies are permeated with the glow of the seven precious jewels, who wear the great wish-fulfilling jewel as their diadem, and who radiate hundreds of thousands of light rays in various colors.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་འཁོར་དང་བཅས་པ་མངོན་པར་དབང་བསྐུར་བར་འགྱུར་རོ།
en: They will be consecrated by all the tathāgatas and the bodhisattvas along with their retinues, who will place a strip of cloth on his head.

source: །དེ་ལྟར་རྒྱ་ཆེ་ཞིང་ཡངས་པ་ཆེ་བའི་གཞལ་མེད་ཁང་འདི་མཆོད་པ་དང་བསྙེན་བཀུར་བ་ཉེ་བར་གནས་པར་འགྱུར་རོ། །གང་གིས་དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དང་དཀྱིལ་འཁོར་གྱི་ལྷ་རྣམས་ལ་དབང་བསྐུར་བ་དང་མཆོད་པ་དང་། བསྙེན་བཀུར་བ་ཆེན་པོར་བྱས་པར་འགྱུར་རོ།
en: Accordingly, a vast array of worship and offerings items will appear to honor the tathāgatas of the three times, along with the bodhisattvas and the maṇḍala deities, with an act of service and worship. “

source: །སྙིང་པོ་འདི་བཟླས་པ་ཙམ་གྱིས་རིག་སྔགས་འཆང་གི་སྡིག་པ་དང་། སྒྲིབ་པ་དང་། གདུག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར། རྣམ་པར་ཉམས་པར་བྱེད། རྣམ་པར་ཞིག་པར་བྱེད། ལུས་དང་ངག་དང་ཡིད་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: Merely by reciting this heart dhāraṇī, all the wrongdoings, obscurations, and faults of the vidyā holder will be pacified, eradicated, and completely destroyed, and his body, speech, and mind will be completely purified.

source: །ཉོན་མོངས་པ་དང་། སྒྲིབ་པ་དང་བྲལ་ཞིང་ངེས་པར་གྲོལ་བར་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་སོགས་པར་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: He will be freed from all his afflictions and obscurations, accumulate a tremendous amount of merit, and plant many roots of great virtue.

source: །དངོས་གྲུབ་ཆེན་པོའི་མཆོག་ཏུ་འགྱུར་རོ། །ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པར་འགྱུར་རོ།
en: He will attain the supreme accomplishment and will not be obstructed in any way.

source: །མཆོད་པ་དང་། བསྙེན་བཀུར་བ་དང་། ཚིག་བཙུན་པར་འགྱུར་རོ། །སྡིག་པ་ཐུན་ཚགས་དང་བྲལ་བར་འགྱུར་རོ།
en: He will become an object of worship, his speech will be pleasant to hear, and his wrongdoings and moral stains will be purified.

source: །ལུས་ལ་དྲི་བཟང་པོ་འབྱུང་བར་འགྱུར་རོ། །རྟག་ཏུ་དེ་དྲན་པས་ཁ་ནས་ཨུཏྤ་ལའི་དྲི་འབྱིན་ནོ། །ལུས་ཙནྡན་གྱི་དྲིས་བསྒོས་པར་འགྱུར་རོ།
en: He will exude a pleasant fragrance, his breath will always give off the scent of a lotus, and his body will smell of sandalwood. “

source: །སེམས་ཅན་ཐམས་ཅད་མཆོག་ཏུ་བྱམས་པ་དང་། མཆོད་པའི་འོས་སུ་འགྱུར་རོ།
en: Filled with love for all beings, the vidyā holder will be worthy of supreme veneration.

source: །ཐམས་ཅད་དུ་དངོས་གྲུབ་ཆེན་པོའི་མཆོག་ཏུ་འགྱུར་རོ། །བགེགས་དང་ལོག་པར་འདྲེན་པ་ཐམས་ཅད་རབ་ཏུ་འདུལ་བར་འགྱུར་རོ། །འབྱུང་པོ་དང་།
en: He will attain great success, excel in everything, and be able to destroy all vighnas and vināyakas.

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་ཐམས་ཅད་མཐོང་བ་ཙམ་གྱིས་རིང་དུ་འབྲོས་པར་འགྱུར་རོ། །ཇི་སྲིད་འཚོའི་བར་དུ་ཉེ་བར་གནས་པར་འགྱུར་རོ།
en: All bhūtas, yakṣas, rākṣasas, pretas, and piśācas will flee at the mere sight of him, and the devas from far and near will attend upon him for as long as he lives.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་མཆོག་སྦྱིན་པར་འགྱུར་རོ། །རྟག་ཏུ་ཡང་མཐོང་བར་འབྱུང་བར་འགྱུར་རོ།
en: He will always receive boons from Noble Avalokiteśvara and will be able to see him whenever he wishes.

source: །རིག་པའི་རྒྱལ་པོ་ཡང་རྟག་པར་རྒྱུན་དུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །དུས་རྒྱུན་དུ་རྟག་ཏུ་མཐོང་བ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །རྟག་ཏུ་རྗེས་སུ་འབྲང་བ་དང་།
en: The king of vidyās will continually stay with him, always present and always in sight.

source: དངོས་གྲུབ་ཏུ་འགྱུར་རོ།
en: His success will never leave him.

source: །ཐམས་ཅད་དུ་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་དུ་མངོན་པར་དབང་བསྐུར་བར་འགྱུར་རོ། །ཐམས་ཅད་དུ་དོན་ཡོད་པའི་དངོས་གྲུབ་ཀྱི་མཆོག་ཏུ་འགྱུར་རོ།
en: He will be fully consecrated as the master of the maṇḍala and will attain the supreme amogha accomplishment and all that this entails. “

source: །དོན་ཡོད་པ་པདྨའི་དཀྱིལ་འཁོར་གྱི་དབང་བསྐུར་བའི་གཟུངས་སོ།
en: This concludes the instructions on the dhāraṇī employed in the amogha lotus consecration into the maṇḍala. “

source: །དེ་ནས་དོན་ཡོད་པའི་ནོར་བུའི་མཆོད་པའི་སྤྲིན་གྱི་ཉེ་བར་སྤྱོད་པའི་ཆོ་གར་འགྱུར་ཏེ།
en: Now I will teach the amogha practice procedure precious amogha clouds of offerings.

source: དྲན་པ་དང་། བཀླགས་པ་དང་། བཟླས་པ་ཙམ་གྱིས་གཞལ་མེད་ཁང་ཆེན་པོ་རྒྱ་ཆེ་བ་ཡངས་པའི་མཐུ་སྟོབས་ཡངས་པ་འབྱུང་བར་འགྱུར་རོ།
en: If one merely remembers, reads, or recites this dhāraṇī, a vast display will be produced and great power generated.

source: །མཐུ་སྟོབས་ཆེན་པོའི་ཡོན་ཏན་འབྱུང་ཞིང་མཆོད་པའི་སྤྲིན་གྱི་ཆར་ཆེན་པོ་འབབ་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པའི་སྤྲིན་གྱི་ཆར་ཆེན་པོ་འབབ་པར་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཕུང་པོའི་ཚོགས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ།
en: A great rain will arise through this great power, causing these good qualities to rain down clouds of offerings—a great rain of offerings for all the tathāgatas that magically accumulates a great amount of merit for the vidyā holder.

source: །རིག་པའི་རྒྱལ་པོ་འདི་དྲན་པ་ཙམ་དང་བཟླས་པ་ཙམ་གྱི་མོད་ལ། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ཏུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོར་མཆོད་པའི་སྤྲིན་གྱི་ཆར་ཆེན་པོ་འབབ་པར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། པདྨ་དང་། ཨུཏྤ་ལ་དང་། ཀུ་མུ་ད་དང་། པདྨ་དཀར་པོ་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། མདོག་མཛེས་དང་། མདོག་མཛེས་ཆེན་པོ་དང་། མཉྫུ་ཥ་ཀ་དང་། ཟླ་བ་མཛེས་པ་དང་། དྲི་མ་མེད་པ་སྟེ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་འབྱུང་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། སྐམ་ལས་སྐྱེས་པའི་མེ་ཏོག །སཱ་ལ་དང་། ཏ་མཱ་ལ་དང་། ཙམ་པ་ཀ་དང་། མྱ་ངན་འཚང་དང་། ཨ་ཏི་མུཀྟཀ་དང་། སྐྱ་སྣར་དང་། མཐོན་ཀ་དང་། མཐོན་ཀ་ཆེན་པོ་དང་།
en: As soon as this king of vidyās is remembered or recited, a great rain will fall, raining down clouds of offerings to all the tathāgatas and their vast retinues in all the buddha fields in the ten directions.

source: ཀ་དམ་པ་དང་། དོང་ཀ་དང་། སིན་དྷུ་བཱ་རི་ཀའི་མེ་ཏོག་དང་། སྣ་མའི་མེ་ཏོག་དང་། ཡཱུ་ཐི་ཀ་དང་།
en: It will rain down pink, blue, and white lotuses and water lilies, and the flowers of mandārava, great mandārava, roca, great roca, and mañjūṣaka plants.

source: མཱ་ལི་ཀ་གསར་པ་དང་། ཏ་ར་ཎ་དང་། ཀུ་པྱ་ཀ་དང་། མ་རུ་བ་ཀའི་མེ་ཏོག་གི་ཆར་འབབ་པར་འགྱུར་རོ། །ལྷ་རྫས་སྣ་ཚོགས་པ་རྣམས་དང་། ཀུ་མུ་དའི་རིགས་རྣམས་དང་། གཟུགས་དང་། ཁ་དོག་སྣ་ཚོགས་པ་དང་། རི་དང་ཆུ་དང་། དགོན་དུང་དང་། ཐིབས་པོ་དང་། ཆུ་རླབས་དང་། ནགས་དང་།
en: It will rain various divine flowers, pure and radiant as the moon, from plants that grow on dry land, including the flowers and blossoms of sal tree, tamāla tree, champak, aśoka, atimuktaka, konta, trumpet tree, nīla, great nīla, kadamba, karnikara, sindhu, vārṣika, sumanas, jāti, yūthikā, navamallikā, taraṇa, kupyaka, maruvaka, and different species of water lilies of various shapes and colors. “

source: ནགས་འདབ་དང་། སྐྱེད་མོས་ཚལ་དང་། ཆུ་ཀླུང་དང་། ལྟེང་ཀ་དང་། རྫིང་བུ་དང་། ཨ་སཱ་ཧི་ཏ་དང་།
en: Forest thickets gently swayed by mountain breezes, groves, parks, gardens, rivers, lakes, wild forests with lotus ponds, and waterfalls and secret hiding places will also appear.

source: ཕུག་དང་། དགོན་པར་འབབ་པའི་ས་ལས་སྐྱེས་པའི་མེ་ཏོག་དང་། དྲི་མ་མེད་པའི་ལྷ་རྫས་དང་། ལྷ་རྫས་ཀྱི་དྲི་བཟང་དང་། ཡིད་དུ་འོང་བའི་གཟུགས་དང་།
en: Immaculate flowers with divine scents, captivating with their colors and forms, fresh and refreshing to the touch, will magically appear and rain down.

source: ཁ་དོག་དང་། ཤིན་ཏུ་གཞོན་ཤ་ཆགས་པ་དང་། རབ་ཏུ་སིམ་པར་བྱེད་པའི་རེག་པ་ལས་སྐྱེས་པའི་ཆར་འབབ་པར་བྱེད་དོ། །མེ་ཏོག་ཆེན་པོ་དང་། མེ་ཏོག་སྐྱེས་པ་རྣམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་གཅལ་དུ་བཀྲམ་པ་རྣམས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མཆོད་པའི་སྤྲིན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: Abundant flowers and blossoms will appear and amass in great heaps before the Blessed One as offerings.

source: །དེ་བཞིན་དུ་དྲན་པ་དང་བསམས་པ་ཙམ་གྱིས་མེ་ཏོག་གི་མཆོད་པ་ཆེན་པོ་བྱེད་དོ། །འདི་ལྟ་སྟེ།
en: Thus, by merely remembering or contemplating of the dhāraṇī, a great offering of flowers will be produced. “

source: དྲན་པ་དང་བསམས་པ་ཙམ་གྱིས་གོས་དང་རྒྱན་རྣམ་པ་སྣ་ཚོགས་རྣམ་པར་བཀྲ་བའི་མཆོད་པའི་སྤྲིན་ཆེན་པོ་ཕྱོགས་བཅུ་ཀུན་ཏུ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པར་འབྱུང་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། དོ་ཤལ་དང་། གདུ་བུ་རྒྱན་ཅན་དང་། དཔུང་རྒྱན་དང་། རྣ་རྒྱན་དང་། གསེར་སྐུད་དང་། མུ་ཏིག་གི་དྲ་བ་དང་། རྐེད་ཆིངས་དང་། ཉིས་སྐོར་དང་། སུམ་སྐོར་དང་། སྐར་མའི་ཕྲེང་བ་དང་། གཙུག་ཏོར་འཆིང་བ་དང་། ཟླ་བ་ཕྱེད་པ་ཅན་དང་། གསེར་ཕྱེད་པ་དང་། གདུ་བུ་རྒྱན་ཅན་ཟླ་བ་ཕྱེད་པ་དང་། ཤང་ཤང་ཏེའུ་ཅན་དང་། དབུ་རྒྱན་དང་། ཅོད་པན་གྱི་དྲ་བ་དང་། གསེར་གྱི་དྲ་བ་དང་། ཨཾ་བི་ཀ་དང་། ཀརྞཱ་ཕ་ལ་ཀ་དང་། བྲེ་ཙ་ཀ་དང་། ཏཱམྤའི་སྐུད་པ་དང་། མཆོད་ཕྱིར་ཐོགས་དང་།
en: By merely remembering or contemplating the dhāraṇī, offerings such as clothes and adornments, and masses of various other fine offerings for all the tathāgatas in the ten directions, will appear.

source: ཀསྥའི་ཕྲེང་བ་དང་། གསེར་གྱི་ཕྲེང་བ་དང་། རིན་པོ་ཆེས་སྤྲས་པའི་ཕྲེང་བ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་དྲིལ་བུ་དང་། རྣ་བ་གང་བ་དང་། གཙུག་ཏོར་འཆིང་བ་དང་། ཡོངས་སུ་དཀྲི་བ་དང་། གཙུག་གི་ནོར་བུའི་ཆར་རབ་ཏུ་འབབ་པར་འགྱུར་རོ།
en: It will rain pearl necklaces, wrist bracelets, arm bracelets, earrings, golden strings, lattices of pearls, waistbands, double and triple strings of pearls, nakṣatra necklaces, diadems, adornments shaped like the crescent moon, golden bracelets, head adornments such as pheasant and peacock plumes, golden lattices, asvika, karṇāphalika, vrecaka, tāmpha strings, sacred threads, kampha necklaces, golden necklaces, necklaces studded with jewels, small bells made of seven precious jewels, flower ornaments for the ears, turbans, headbands, and crest jewels. “

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པའི་སྤྲིན་དུ་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་གསང་བ་རྣམས་ཀྱི་མཆོད་པའི་སྤྲིན་ཆེན་པོར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་གསང་བ་རྣམས་ཀྱི་མཆོད་པའི་སྤྲིན་ཆེན་པོར་གྱུར་ནས། རང་རང་གི་གཞལ་མེད་ཁང་གི་འབྱོར་པར་རབ་ཏུ་འགྱུར་རོ།
en: Great masses of offerings for all the tathāgatas will appear, including masses of offerings for the secret maṇḍalas of all the tathāgatas, with individual palaces appearing for each and every one of them.

source: །ཆར་དང་། ཚོན་སྣ་ཚོགས་སུ་བཙོས་པའི་ཕྱོགས་བྲལ་གྱི་གོས་སྣ་ཚོགས་པའི་མཆོད་པའི་སྤྲིན་དུ་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞིང་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་རྣམས་དང་རྗེས་སུ་མཐུན་པའི་རི་མོའི་གོས་དང་། རི་མོའི་གཞལ་མེད་ཁང་གི་མཆོད་པའི་སྤྲིན་གྱི་ཆར་འབེབས་སོ། །འདི་ལྟ་སྟེ།
en: Offerings of various pieces of clothing, dyed nice colors, will rain in great abundance for all the tathāgatas in all buddha fields in the ten directions and for the tathāgatas of all secret maṇḍalas.

source: ཡུལ་ཀ་ཤི་ཀའི་གོས་ཚོན་སྣ་ཚོགས་སུ་བཙོས་པ་དང་། གོས་ཀྱི་གཞལ་མེད་ཁང་དང་། དར་གོས་རྣམས་ཀྱི་ཆར་འབེབས་སོ། །འདི་ལྟ་སྟེ། ཉི་མའི་འོད་དང་། ཟླ་བ་དང་། སེང་གེ་སྐྱེས་དང་། དར་ཐོད་དང་། ཀ་ཤི་ཀ་དང་། ཀོ་ས་ལ་པའི་མིའི་དབང་པོ་དང་། ཉི་མ་དང་།
en: There will rain down masses of offerings that consist of well-fitting silk garments and other silk products, such as well-tailored clothes of Vārāṇasī silk dyed various colors, clothes of woven silk, and silks known as resplendence of the sun, brightness of the moon, and strong as a lion, as well as silks from Vārāṇasī and Kośala. “

source: ཟླ་བའི་སྣང་བ་དང་། པདྨོ་དང་། ཨུཏྤ་ལ་ཅན་གྱི་ཁ་དོག་དང་། ཀོ་དྲི་ཀཱ་དང་། གསེར་གྱི་གདུ་བུ་དང་། མུ་ཏིག་གི་འབྲས་བུ་དང་།
en: The fabrics will match the brightness of the sun and the moon and will come in colors of pink or blue lotus, sauvarcala salt, golden bracelets, pearl, or phalaka.

source: ཀླུའི་གོ་ཆ་དང་། རྣམ་པར་སྣང་བ་དང་། ལྷའི་རྒྱན་དང་། མེ་ཏོག་སྣ་མ་དང་། ཀོ་ཤ་དང་།
en: They will be as bright as a nāga armor, celestial flowers, jasmine buds, and champak flowers.

source: ཙམ་པ་ཀ་དང་། ཁ་དོག་ཅན་དང་། དར་ཐོད་ཅན་དང་། ཀནྟ་རའི་ཚོགས་དང་། ཟླ་བའི་རྒྱན་ཅན་དང་།
en: They will be as bright as the stars and the moon.

source: དོང་ཀའི་མེ་ཏོག་ཅན་དང་། པདྨ་དཀར་པོ་ཅན་ཞེས་བྱ་བ་དང་། བ་མ་ལཾ་ཀ་དང་། ཀོ་ཤཱ་ཏ་ཀི་དང་། རྫོགས་པར་འཕེལ་བར་བྱེད་པ་ཅན་དང་། སྔོན་གྱི་ཡུལ་དང་གླིང་དང་ལྡན་པ་ཀུན་ནས་འོད་གསལ་བ་དང་། གདུ་བུ་རིང་པོ་དང་། དགའ་བ་འཁྱིལ་བ་དང་། རྒྱན་བསྐོར་བ་དང་། སྣ་མའི་མེ་ཏོག་གི་ཁ་དོག་ཅན་དང་། ཀན་དའི་འདབ་མ་ཅན་དང་། དཀྵི་ཎཱ་ཀཾ་དང་། ཀཉྩི་ནཱ་སའི་ཁ་དོག་ཅན་ནམ་བསྐོར་བ་དང་། གསེར་མདོག་དང་།
en: They will be as pure as karṇikāra flowers and white lotus and will be brighter than the full moon rising over the eastern horizon.

source: རིན་པོ་ཆེའི་མདོག་དང་། ཟླ་བའི་ཁ་དོག་གི་ལག་པ་དང་། མེའི་ཁ་དོག་ཅན་དང་། བཻ་ཌཱུརྱའི་ཁ་དོག་ཅན་དང་། ནམ་མཁའི་ཁ་དོག་ཅན་དང་།
en: They will come in spotted, bright varieties and have the colors of a yak’s tail, crepe jasmine (the best of flowers), jāti or sumanas, or the colors of kandapallaka,dakṣiṇādyaka,cīnāsavartaka, the face of a bhūta, golden buda, jewel buda, the moon, fire, beryl stone, the sky, kanagnīśuka, and beautiful curly hairs that are bright and shining. “

source: ཀ་ནགྣི་ཤུ་ཀཾ་དང་། ཀུན་ནས་འཁྱིལ་ཞིང་ཡིད་བདེ་བའི་བ་སྤུ་རྣམ་པར་སྣང་ཞིང་རྣམ་པར་གསལ་པ་ཙན་དང་། ཀུན་ནས་འོད་གསལ་ཞིང་དྲི་མ་མེད་པའི་རིག་སྔགས་འཆང་གི་ཅོད་པན་ཅན་ཡང་ངོ་ཞེས་སོ། །གོས་རྣམ་པ་སྣ་ཚོགས་པ་གཞལ་དུ་མེད་པའི་ཆར་འབེབས་ཏེ། བཅོམ་ལྡན་འདས་རྣམས་གཞལ་དུ་མེད་པའི་མཆོད་སྤྲིན་དང་བཅས་པའི་ཆར་འབེབས་སོ།
en: It will rain the all-bright vidyādhara headbands and various pieces of clothing and magically produced articles as an offering for the Blessed One.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་དུ་གནས་པའི་རིག་སྔགས་ཀྱི་ལྷ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་རྣམས་དང་། རྡོ་རྗེ་འཆང་དང་། རིག་སྔགས་འཆང་གི་དབང་པོ་རིག་སྔགས་འཆང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བའི་མཆོད་པའི་སྤྲིན་དུ་འགྱུར་རོ། །དེ་ལྟར་རིག་སྔགས་དྲན་པ་ཙམ་གྱིས་དེ་བཞིན་དུ་རྣམ་པ་སྣ་ཚོགས་པའི་མཆོད་པར་འགྱུར་རོ། །དྲི་སྣ་ཚོགས་པའི་ཆུ་གཞལ་དུ་མེད་པ་དང་། དྲིའི་ཕྱེ་མ་གཞལ་དུ་མེད་པ་དང་།
en: Masses of such articles will rain down as an offering for all the vidyā deities dwelling in the secret maṇḍalas of all the tathāgatas, for all the bodhisattvas, for Vajradhara the lord of vidyādharas, and for all the vidyādharas with their retinues.

source: བདུག་པ་གཞལ་དུ་མེད་པའི་མཆོད་པར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། ཙནྡན་གོ་ཤིརྵ་དང་།
en: Such articles of offering will appear by merely recalling the vidyā.

source: ཏ་མ་ལའི་འདབ་མ་དང་། ཙནྡན་དང་། ཙནྡན་དམར་པོ་དང་། པདྨ་ཅན་དང་། དྲི་ཞིམ་པ་དང་། སར་ལམ་དང་། གུར་གུམ་དང་། གོས་དང་ལྡན་པ་དང་། དྲི་དང་ལྡན་པ་དང་། པུ་ཤེལ་ཙི་དང་། རྒྱ་སྤོས་དང་། ཏུ་རུཥྐ་དང་། སྤྲྀཀ་དང་། བོ་ལ་དང་། སྲ་རྩི་པོག་དང་། ན་མེ་རུ་དང་། ཤྲཱི་བེཥྚཱ་ཀ་དང་། པོག་དང་། སལླ་ཀི་དང་། གུ་གུལ་གྱི་བདུག་པ་དང་། ཧྭགས་དང་། སྦྲང་རྩི་དང་། ལྔ་བསྐོར་བ་དང་། ཀ་ཛོ་ཀ་དང་།
en: They will include articles such as various perfumes, scented powders, and incense including gośīrṣa sandalwood, white sandalwood, tamāla leaves, red sandalwood, padmaka, surabhi, pine resin, and saffron combined with various other fragrances and scents.

source: བལླི་ཀའི་ཤིང་དང་། བལླི་ཀ་དང་། ག་པུར་དང་། གླ་རྩི་དང་། རྣམ་པ་སྣ་ཚོགས་རྣམ་པར་བཀྲ་བའི་བདུག་པ་གཞན་སྦྱར་བ་རྣམས་དང་།
en: They will also include uśīra grass, tagara, olibanum, fenugreek, myrrh, sarjarasa, nameru, pine resin, frankincense, sallakī, the incense of bdellium, sugar, honey, the five āvartaka, joka vallika and wooden vallika, camphor, musk, and various other incense preparations and products. “

source: དྲི་ཡི་ཆུའི་རྣམ་པ་རྣམས་དང་། རྣམ་པ་སྣ་ཚོགས་པས་བསྒོས་པའི་ཕྱེ་མ་དང་ལྡན་པ་འབྱུང་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་མཆོད་སྤྲིན་གྱི་ཆར་འབེབས་སོ། །སྒྲོན་མའི་ཤིང་སྣ་ཚོགས་པ། སྦར་བ་གཞལ་དུ་མེད་པས་སྣང་བར་བྱེད་བཞིན་པ་འབར་བར་བྱེད་དོ།
en: An assortment of perfumes and scented powders in various combinations will appear in great quantities and rain down as an offering for the tathāgatas.

source: །ཕྱོགས་བཅུ་རྣམས་སུ་ཀུན་ནས་སྒྲོན་མའི་ཤིང་གངྒཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དང་མཉམ་པའི་སྒྲོན་མའི་ཤིང་རབ་ཏུ་འབྱུང་ངོ་། །འདི་ལྟ་སྟེ། ཏུ་རུཥྐའི་ཏིལ་མར་དང་། ཙམ་པ་ཀའི་ཏིལ་མར་དང་། ཨུཏྤ་ལའི་ཏིལ་མར་དང་། སྣ་མའི་ཏིལ་མར་དང་། བརྵི་ཀའི་ཏིལ་མར་དང་། ཀོནྟའི་ཏིལ་མར་དང་། ཨ་ཏི་མུཀྟ་ཀའི་ཏལ་མར་དང་།
en: Various trees decorated with burning lamps will appear in all the ten directions, numbering hundreds of thousands of millions of billions, as numerous as the grains of sand in the Gaṅgā river.

source: པ་ལ་ཤའི་ཏིལ་མར་དང་། ཙནྡན་གྱི་ཏིལ་མར་དང་། ཛཱ་ཏིའི་འབྲས་བུའི་ཏིལ་མར་དང་། བལླའི་ཏིལ་མར་དང་། ཨ་ཤོ་གནྡྷ་ལ་སོགས་པའི་ཏིལ་མར་ལ་སྒྲོན་མེ་རབ་ཏུ་བྱེད་དེ།
en: The lamps will be scented with olibanum, champak, blue water lily, sumanas, vārṣika, konta, adhimuktaka, flame-of-the-forest, sandalwood, nutmeg, vālā, winter cherry, and so forth. “

source: དེ་བཞིན་གཤེགས་པ་མཆོད་པའི་སྤྲིན་དུ་འགྱུར་རོ། །འདི་ལྟ་སྟེ།
en: Other articles, such as food with hundreds of flavors, will also appear in great quantities as an offering to the tathāgatas.

source: རོ་བརྒྱ་པའི་ཁ་ཟས་རྣམས་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡུལ་དང་དུས་སུ་ཉེ་བར་བཞུགས་པ་རྣམས་ཀྱི་སྤྱན་སྔར་རབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: They will appear before all the tathāgatas, the worthy, fully realized buddhas established in all places and times.

source: །འདི་ལྟ་སྟེ། རོ་བྲོ་བའི་མཆོག་རྣམ་པ་སྣ་ཚོགས་པའི་གཟུགས་དང་། རྣམ་པ་དང་། ཞིམ་ཞིང་མངར་བ་མྱང་བར་འོས་པ་དགའ་བར་བྱ་བ་ཡིད་དགའ་བ། ཙོ་ལེ་ཛྱ་དང་ཚིམ་པར་འོས་པ་དང་།
en: They will include the tastiest sweetmeats and delicacies of various kinds that can be savored and relished, delightful sweets that satisfy when sucked or licked.

source: དྲིའི་རིགས་ལྷ་རྫས་རྣམ་པ་སྣ་ཚོགས་པས་དུས་གསུམ་དུ་གཤེགས་པའི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ཚོགས་དང་བཅས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་འཁོར་དང་བཅས་པ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དང་། རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་དང་བཅས་པ་རྣམས་ཀུན་ཏུ་ཚིམ་པར་བྱེད་པའི་འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་པ་དང་།
en: Coming in all divine varieties and with various aromas, they will please and sate the blessed tathāgatas of the three times and their retinues, the bodhisattvas with their retinues, the multitudes of śrāvakas, and the deities of all vidyā maṇḍalas.

source: རོ་བྲོ་བའི་མཆོག་རྣམ་པ་སྣ་ཚོགས་པ་དང་། སྦྲང་རྩི་མངར་པོའི་རོ་མྱོང་བ་དང་ལྡན་པ་བཅོམ་ལྡན་འདས་འཁོར་གྱི་ཚོགས་དང་བཅས་པའི་སྤྱན་སྔར་རབ་ཏུ་འབྱུང་བར་འགྱུར་ཏེ།
en: Various fruits in hundreds of exquisite flavors, deliciously sweet, will appear before the blessed ones and their retinues, satisfying them. “
